[
  {
    "uid": "",
    "intentName": "AMAZON.LaunchRequest",
    "speechText": "Bienvenido a la skill de metodología de la programación!"
  },
  {
    "uid": "",
    "intentName": "AMAZON.FallbackIntent",
    "speechText": "<say-as interpret-as=\"interjection\">hmm</say-as>. Perdona. No he podido encontrar la respuesta a lo que me has preguntado."
  },
  {
    "uid": "",
    "intentName": "AMAZON.HelpIntent",
    "speechText": "Esta skill te permite obtener información acerca de la asignatura de metodología de la programación. Aquí tienes algunos ejemplos de lo que puedes preguntar.",
    "cardText": "¿Qué características tiene la asignatura?\n¿A qué materia pertenece?\n¿Qué prerrequisitos tiene?"
  },
  {
    "uid": "",
    "intentName": "AMAZON.StopIntent",
    "speechText": "<say-as interpret-as=\"interjection\">okey</say-as>."
  },
  {
    "uid": "",
    "intentName": "InfoGeneralIntent_AAA",
    "speechText": "Metodología de la Programación es una asignatura obligatoria de seis créditos E C T S con tres créditos de teoría y tres créditos prácticos."
  },
  {
    "uid": "",
    "intentName": "InfoGeneralIntent_AAB",
    "speechText": "Se encuadra en la materia de Programación."
  },
  {
    "uid": "",
    "intentName": "InfoGeneralIntent_AAC",
    "speechText": "Es conveniente haber cursado la asignatura de primer curso de Programación."
  },
  {
    "uid": "",
    "intentName": "InfoGeneralIntent_AAD",
    "speechText": "Estructuras de Datos. Programación Concurrente y Tiempo Real. Algoritmia. Aplicaciones de Bases de Datos. Optativas de la mención de Ingeniería del Software."
  },
  {
    "uid": "",
    "intentName": "InfoGeneralIntent_AAE",
    "speechText": "Conocer el concepto de modularidad, y el desarrollo orientado a objetos. Saber los conceptos básicos en programación referentes a visiones estáticas y dinámicas como clases y objetos respectivamente. Conocer conceptos avanzados como herencia y genericidad. Resolución de problemas concretos aplicando conceptos previos argumentando las soluciones tomadas. Saber construir software robusto. Conocer y asimilar nuevos avances en la programación."
  },
  {
    "uid": "",
    "intentName": "InfoGeneralIntent_AAF",
    "speechText": "Dos horas de teoría y dos horas de laboratorio a la semana."
  },
  {
    "uid": "",
    "intentName": "InfoGeneralIntent_AAG",
    "speechText": "La asignatura tiene doce semanas presenciales junto con cuatro semanas adicionales para pruebas de evaluación."
  },
  {
    "uid": "",
    "intentName": "",
    "speechText": "",
    "cardTitle": "",
    "cardText": ""
  }
]
